
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//Денисов В.Е 08.08.2024 ТЗ№1 От ДомашнееЗадание13-7
	//ДобавитьСогласованнуюСкидку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Денисов В.Е 08.08.2024 ТЗ№1 От ДомашнееЗадание 13-7
#Область Доработки

&НаСервере 
Процедура ДобавитьСогласованнуюСкидку()
	Группа = Элементы.Вставить("ГруппаСогласованнаяСкидка", Тип("ГруппаФормы"),ЭтаФорма, Элементы.Страницы);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	
	НовыйЭлемент = Элементы.Вставить("Д_СогласованнаяСкидка",Тип("ПолеФормы"),Элементы.ГруппаСолгасованнаяСкидка);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Д_СогласованнаяСкидка";
	НовыйЭлемент.УстановитьДействие("ПриИзменении","Д_СогласованнаяСкидкаПриИзменении");
	
	Команда = Команды.Добавить("ПересчитатьСоСкидкой");
	Команда.Заголовок = "ПересчитатьСоСкидкой";
	Команда.Действие = "КомандаПересчитатьСоСкидкой";
	
	КнопкаФормы = Элементы.Вставить("КнопкаПересчитатьСоСкидкой",Тип("КнопкаФормы"),Элементы.ГруппаСолгасованнаяСкидка);
	КнопкаФормы.ИмяКоманды = "ПересчитатьСоСкидкой";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	КнопкаФормы.Видимость = Истина;
	КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КнопкаФормы.Картинка = БиблиотекаКартинок.Обновить;
	
КонецПроцедуры

//При нажатии команды
&НаКлиенте
Процедура КомандаПересчитатьСоСкидкой (Команда)

	КомандаПересчитатьСоСкидкойСервер();
	
КонецПроцедуры

//Действие,выполняемое командой
&НаКлиенте
Процедура КомандаПересчитатьСоСкидкойСервер()
		
	Для Каждого ЭлементТЧ ИЗ Объект.Услуги Цикл
		РассчитатьСуммуСтрокиТЧ(ЭлементТЧ);
	КонецЦикла; 
	
	
	Для Каждого ЭлементТЧ ИЗ Объект.Товары Цикл
	РассчитатьСуммуСтрокиТЧ(ЭлементТЧ);
	КонецЦикла;
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры 

//Пересчёт суммы элемента в тч со скидкой
&НаКлиенте
Процедура РассчитатьСуммуСтрокиТЧ(ТекущиеДанные) 
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	ТекущиеДанные.Сумма = Сумма - (Сумма * Объект.Д_СогласованнаяСкидка / 100);
КонецПроцедуры

//Задаёт вопрос при изменении значения "СогласованнаяСкидка"
&НаКлиенте
Асинх Процедура Д_СогласованнаяСкидкаПриИзменении(Элемент)

	ТекстВопроса = "Вы уверены, что необходимо пересчитать со скидкой?";
	
	ВариантыОтвета = Новый СписокЗначений;
	ВариантыОтвета.Вставить("0","Нет");
	ВариантыОтвета.Вставить("1","Да");
	
	ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса,ВариантыОтвета,,"Да"); 
	
	Если ОтветПользователя = "Нет" Тогда 
		Возврат;
	ИначеЕсли ОтветПользователя = "Да" Тогда
		КомандаПересчитатьСоСкидкойСервер();
	КонецЕсли;  
	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
